results/results_c5_large/results_c5_large_run2/oltp_read_only_t32/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 117.18 qps: 1897.57 (r/w/o: 1660.11/0.00/237.46) lat (ms,95%): 502.20 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 121.60 qps: 1949.15 (r/w/o: 1705.85/0.00/243.31) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 118.60 qps: 1900.90 (r/w/o: 1663.70/0.00/237.20) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 121.70 qps: 1937.99 (r/w/o: 1694.69/0.00/243.30) lat (ms,95%): 475.79 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 118.80 qps: 1912.11 (r/w/o: 1674.41/0.00/237.70) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 120.50 qps: 1921.61 (r/w/o: 1680.70/0.00/240.90) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 118.70 qps: 1896.99 (r/w/o: 1659.69/0.00/237.30) lat (ms,95%): 520.62 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 120.00 qps: 1920.80 (r/w/o: 1680.60/0.00/240.20) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 113.20 qps: 1810.50 (r/w/o: 1584.10/0.00/226.40) lat (ms,95%): 520.62 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 120.10 qps: 1924.30 (r/w/o: 1684.20/0.00/240.10) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 120.10 qps: 1919.49 (r/w/o: 1679.30/0.00/240.20) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 122.10 qps: 1957.40 (r/w/o: 1713.10/0.00/244.30) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            201012
        write:                           0
        other:                           28716
        total:                           229728
    transactions:                        14358  (119.40 per sec.)
    queries:                             229728 (1910.39 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      119.3996
    time elapsed:                        120.2517s
    total number of events:              14358

Latency (ms):
         min:                                   34.90
         avg:                                  267.73
         max:                                  744.41
         95th percentile:                      493.24
         sum:                              3843995.91

Threads fairness:
    events (avg/stddev):           448.6875/7.70
    execution time (avg/stddev):   120.1249/0.07